In [25]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [2]:
df = DataFrame({'age':[20,21,23,19,22],
                'salary':[1000,11000,9900,8500,15000]},
               index={'张三','lisi','xiaogang','xiaobo','xiaoqi'},columns=['age','salary','work'])
df

          age  salary work
xiaogang   20    1000  NaN
张三         21   11000  NaN
lisi       23    9900  NaN
xiaoqi     19    8500  NaN
xiaobo     22   15000  NaN

In [5]:
df.work['lisi':'xiaobo']='python'

/Users/yue/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [6]:
df

          age  salary    work
xiaogang   20    1000     NaN
张三         21   11000     NaN
lisi       23    9900  python
xiaoqi     19    8500  python
xiaobo     22   15000  python

In [7]:
# drop null 
df.isnull()

            age  salary   work
xiaogang  False   False   True
张三        False   False   True
lisi      False   False  False
xiaoqi    False   False  False
xiaobo    False   False  False

In [13]:
s1 = df.isnull().any(axis=1)
s1

xiaogang     True
张三           True
lisi        False
xiaoqi      False
xiaobo      False
dtype: bool

In [14]:
df.isnull().any(axis=0)

age       False
salary    False
work       True
dtype: bool

In [12]:
# 有了s1 ，获取哪些数据为空
df[s1]

          age  salary work
xiaogang   20    1000  NaN
张三         21   11000  NaN

In [18]:
s2 = df.notnull().all(axis=1)
s2

xiaogang    False
张三          False
lisi         True
xiaoqi       True
xiaobo       True
dtype: bool

In [20]:
df[s2]

        age  salary    work
lisi     23    9900  python
xiaoqi   19    8500  python
xiaobo   22   15000  python

In [23]:
df.dropna(axis=0,how='all')

        age  salary    work
lisi     23    9900  python
xiaoqi   19    8500  python
xiaobo   22   15000  python

In [26]:
df.loc['张三'] = np.nan
df

           age   salary    work
xiaogang  20.0   1000.0     NaN
张三         NaN      NaN     NaN
lisi      23.0   9900.0  python
xiaoqi    19.0   8500.0  python
xiaobo    22.0  15000.0  python

In [32]:
df.dropna(how='all')

           age   salary    work
xiaogang  20.0   1000.0     NaN
lisi      23.0   9900.0  python
xiaoqi    19.0   8500.0  python
xiaobo    22.0  15000.0  python

In [33]:
df.fillna(value='Java')

           age salary    work
xiaogang    20   1000    Java
张三        Java   Java    Java
lisi        23   9900  python
xiaoqi      19   8500  python
xiaobo      22  15000  python

In [35]:
df.fillna(method='backfill')

           age   salary    work
xiaogang  20.0   1000.0  python
张三        23.0   9900.0  python
lisi      23.0   9900.0  python
xiaoqi    19.0   8500.0  python
xiaobo    22.0  15000.0  python

In [36]:
df.fillna(method='ffill')

           age   salary    work
xiaogang  20.0   1000.0     NaN
张三        20.0   1000.0     NaN
lisi      23.0   9900.0  python
xiaoqi    19.0   8500.0  python
xiaobo    22.0  15000.0  python

In [37]:
df

           age   salary    work
xiaogang  20.0   1000.0     NaN
张三         NaN      NaN     NaN
lisi      23.0   9900.0  python
xiaoqi    19.0   8500.0  python
xiaobo    22.0  15000.0  python